rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_LPUART.h
/*
** ###################################################################
**     Processor:           S32K388_M7
**     Reference manual:    S32K3xx RM Rev.8 Draft B
**     Version:             rev. 1.3, 2023-09-12
**     Build:               b230922
**
**     Abstract:
**         Peripheral Access Layer for S32K388_M7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2023 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K388_LPUART.h
 * @version 1.3
 * @date 2023-09-12
 * @brief Peripheral Access Layer for S32K388_LPUART
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K388_LPUART_H_)  /* Check if memory map has not been already included */
#define S32K388_LPUART_H_

#include "S32K388_COMMON.h"

/* ----------------------------------------------------------------------------
   -- LPUART Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPUART_Peripheral_Access_Layer LPUART Peripheral Access Layer
 * @{
 */

/** LPUART - Size of Registers Arrays */
#define LPUART_TIMEOUT_COUNT                      4u
#define LPUART_TCBR_COUNT                         128u
#define LPUART_TDBR_COUNT                         256u

/** LPUART - Register Layout Typedef */
typedef struct {
  __I  uint32_t VERID;                             /**< Version ID, offset: 0x0 */
  __I  uint32_t PARAM;                             /**< Parameter, offset: 0x4 */
  __IO uint32_t GLOBAL;                            /**< Global, offset: 0x8 */
  __IO uint32_t PINCFG;                            /**< Pin Configuration, offset: 0xC */
  __IO uint32_t BAUD;                              /**< Baud Rate, offset: 0x10 */
  __IO uint32_t STAT;                              /**< Status, offset: 0x14 */
  __IO uint32_t CTRL;                              /**< Control, offset: 0x18 */
  __IO uint32_t DATA;                              /**< Data, offset: 0x1C */
  __IO uint32_t MATCH;                             /**< Match Address, offset: 0x20 */
  __IO uint32_t MODIR;                             /**< MODEM IrDA, offset: 0x24 */
  __IO uint32_t FIFO;                              /**< FIFO, offset: 0x28 */
  __IO uint32_t WATER;                             /**< Watermark, offset: 0x2C */
  __I  uint32_t DATARO;                            /**< Data Read-Only, offset: 0x30 */
  uint8_t RESERVED_0[12];
  __IO uint32_t MCR;                               /**< MODEM Control, offset: 0x40, not available in all instances (available on 2 out of 16) */
  __IO uint32_t MSR;                               /**< MODEM Status, offset: 0x44, not available in all instances (available on 2 out of 16) */
  __IO uint32_t REIR;                              /**< Receiver Extended Idle, offset: 0x48, not available in all instances (available on 2 out of 16) */
  __IO uint32_t TEIR;                              /**< Transmitter Extended Idle, offset: 0x4C, not available in all instances (available on 2 out of 16) */
  __IO uint32_t HDCR;                              /**< Half Duplex Control, offset: 0x50, not available in all instances (available on 2 out of 16) */
  uint8_t RESERVED_1[4];
  __IO uint32_t TOCR;                              /**< Timeout Control, offset: 0x58, not available in all instances (available on 2 out of 16) */
  __IO uint32_t TOSR;                              /**< Timeout Status, offset: 0x5C, not available in all instances (available on 2 out of 16) */
  __IO uint32_t TIMEOUT[LPUART_TIMEOUT_COUNT];     /**< Timeout N, array offset: 0x60, array step: 0x4, not available in all instances (available on 2 out of 16) */
  uint8_t RESERVED_2[400];
  __O  uint32_t TCBR[LPUART_TCBR_COUNT];           /**< Transmit Command Burst, array offset: 0x200, array step: 0x4, not available in all instances (available on 2 out of 16) */
  __O  uint32_t TDBR[LPUART_TDBR_COUNT];           /**< Transmit Data Burst, array offset: 0x400, array step: 0x4, not available in all instances (available on 2 out of 16) */
} LPUART_Type, *LPUART_MemMapPtr;

/** Number of instances of the LPUART module. */
#define LPUART_INSTANCE_COUNT                    (16u)

/* LPUART - Peripheral instance base addresses */
/** Peripheral LPUART_0 base address */
#define IP_LPUART_0_BASE                         (0x40328000u)
/** Peripheral LPUART_0 base pointer */
#define IP_LPUART_0                              ((LPUART_Type *)IP_LPUART_0_BASE)
/** Peripheral LPUART_1 base address */
#define IP_LPUART_1_BASE                         (0x4032C000u)
/** Peripheral LPUART_1 base pointer */
#define IP_LPUART_1                              ((LPUART_Type *)IP_LPUART_1_BASE)
/** Peripheral LPUART_2 base address */
#define IP_LPUART_2_BASE                         (0x40330000u)
/** Peripheral LPUART_2 base pointer */
#define IP_LPUART_2                              ((LPUART_Type *)IP_LPUART_2_BASE)
/** Peripheral LPUART_3 base address */
#define IP_LPUART_3_BASE                         (0x40334000u)
/** Peripheral LPUART_3 base pointer */
#define IP_LPUART_3                              ((LPUART_Type *)IP_LPUART_3_BASE)
/** Peripheral LPUART_4 base address */
#define IP_LPUART_4_BASE                         (0x40338000u)
/** Peripheral LPUART_4 base pointer */
#define IP_LPUART_4                              ((LPUART_Type *)IP_LPUART_4_BASE)
/** Peripheral LPUART_5 base address */
#define IP_LPUART_5_BASE                         (0x4033C000u)
/** Peripheral LPUART_5 base pointer */
#define IP_LPUART_5                              ((LPUART_Type *)IP_LPUART_5_BASE)
/** Peripheral LPUART_6 base address */
#define IP_LPUART_6_BASE                         (0x40340000u)
/** Peripheral LPUART_6 base pointer */
#define IP_LPUART_6                              ((LPUART_Type *)IP_LPUART_6_BASE)
/** Peripheral LPUART_7 base address */
#define IP_LPUART_7_BASE                         (0x40344000u)
/** Peripheral LPUART_7 base pointer */
#define IP_LPUART_7                              ((LPUART_Type *)IP_LPUART_7_BASE)
/** Peripheral LPUART_8 base address */
#define IP_LPUART_8_BASE                         (0x4048C000u)
/** Peripheral LPUART_8 base pointer */
#define IP_LPUART_8                              ((LPUART_Type *)IP_LPUART_8_BASE)
/** Peripheral LPUART_9 base address */
#define IP_LPUART_9_BASE                         (0x40490000u)
/** Peripheral LPUART_9 base pointer */
#define IP_LPUART_9                              ((LPUART_Type *)IP_LPUART_9_BASE)
/** Peripheral LPUART_10 base address */
#define IP_LPUART_10_BASE                        (0x40494000u)
/** Peripheral LPUART_10 base pointer */
#define IP_LPUART_10                             ((LPUART_Type *)IP_LPUART_10_BASE)
/** Peripheral LPUART_11 base address */
#define IP_LPUART_11_BASE                        (0x40498000u)
/** Peripheral LPUART_11 base pointer */
#define IP_LPUART_11                             ((LPUART_Type *)IP_LPUART_11_BASE)
/** Peripheral LPUART_12 base address */
#define IP_LPUART_12_BASE                        (0x4049C000u)
/** Peripheral LPUART_12 base pointer */
#define IP_LPUART_12                             ((LPUART_Type *)IP_LPUART_12_BASE)
/** Peripheral LPUART_13 base address */
#define IP_LPUART_13_BASE                        (0x404A0000u)
/** Peripheral LPUART_13 base pointer */
#define IP_LPUART_13                             ((LPUART_Type *)IP_LPUART_13_BASE)
/** Peripheral LPUART_14 base address */
#define IP_LPUART_14_BASE                        (0x404A4000u)
/** Peripheral LPUART_14 base pointer */
#define IP_LPUART_14                             ((LPUART_Type *)IP_LPUART_14_BASE)
/** Peripheral LPUART_15 base address */
#define IP_LPUART_15_BASE                        (0x404A8000u)
/** Peripheral LPUART_15 base pointer */
#define IP_LPUART_15                             ((LPUART_Type *)IP_LPUART_15_BASE)
/** Array initializer of LPUART peripheral base addresses */
#define IP_LPUART_BASE_ADDRS                     { IP_LPUART_0_BASE, IP_LPUART_1_BASE, IP_LPUART_2_BASE, IP_LPUART_3_BASE, IP_LPUART_4_BASE, IP_LPUART_5_BASE, IP_LPUART_6_BASE, IP_LPUART_7_BASE, IP_LPUART_8_BASE, IP_LPUART_9_BASE, IP_LPUART_10_BASE, IP_LPUART_11_BASE, IP_LPUART_12_BASE, IP_LPUART_13_BASE, IP_LPUART_14_BASE, IP_LPUART_15_BASE }
/** Array initializer of LPUART peripheral base pointers */
#define IP_LPUART_BASE_PTRS                      { IP_LPUART_0, IP_LPUART_1, IP_LPUART_2, IP_LPUART_3, IP_LPUART_4, IP_LPUART_5, IP_LPUART_6, IP_LPUART_7, IP_LPUART_8, IP_LPUART_9, IP_LPUART_10, IP_LPUART_11, IP_LPUART_12, IP_LPUART_13, IP_LPUART_14, IP_LPUART_15 }

/* ----------------------------------------------------------------------------
   -- LPUART Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPUART_Register_Masks LPUART Register Masks
 * @{
 */

